<?php

namespace App\PWServer;

class StaticData {

    public function instances() {
        $list = Array(
                "gs01" => "Мир",
                "is01" => "Город темных зверей",
                "is02" => "Могильник героя, Храм боевых искусств, Монастырь воина",
                "is03" => "Паутинная пещера",
                "is04" => "Смрадная пещера",
                "is05" => "Пещера огненных скал",
                "is06" => "Логово бешеных волков",
                "is07" => "Пещера ползучих гадов",
                "is08" => "Зеленый курган",
                "is09" => "Темная обитель",
                "is10" => "Инеевый предел",
                "is11" => "Долина расхитителей небес",
                "is12" => "Руины в джунглях",
                "is13" => "Предел наваждений",
                "is14" => "Врата беспокойных духов",
                "is15" => "Пещера драгоценностей",
                "is16" => "Небо иллюзий",
                "is17" => "Небо наваждений",
                "is18" => "Дворец царя драконов",
                "is19" => "Остров ночного плача",
                "is20" => "Остров тысячи змей",
                "is21" => "Земли небожителей",
                "is22" => "Земли магов и демонов",
                "is23" => "Чистилище",
                "is24" => "Земной ад",
                "is25" => "Город боевых песен",
                "is26" => "Зал перерождения",
                "is27" => "Долина священной луны",
                "is28" => "Долина безбожников",
                "is29" => "Город Инея",
                "is30" => "Дворец темных песков",
                "is31" => "Сумеречный храм",
                "is32" => "Куб судьбы",
                "is33" => "Лабиринт времени",
                "is34" => "Зал свадеб",
                "is35" => "База гильдии",
                "is37" => "Морай",
                "is38" => "Ущелье Феникса",
                "is39" => "Пещеры вечности - нижний ярус",
                "is40" => "Дворец короля сминфисов, Пещеры, Зал трех начал, Мираж в стране Грез, Сокровищница Страны фонарей",
                "is41" => "Пещеры вечности - верхний ярус",
                "is42" => "Долина битв",
                "is43" => "Города пяти императоров",
                "is44" => "Битва династи - Остров захвата флага",
                "is45" => "Битва династи - Битва за кристаллы",
                "is46" => "Битва династи - Битва на мосту",
                "is47" => "Долина заката",
                "is48" => "Зал наказаний",
                "is49" => "Драконье убежище",
                "is50" => "Страна грез",
                "is61" => "Переправа душ",
                "is62" => "Изначальный мир",
                "is63" => "Мир людей",
                "is66" => "Серебряная цитадель",
                "is67" => "Храм стихий",
                "is68" => "Мир людей (Режим сюжета)",
                "is69" => "Светлая пещера",
                "is70" => "Куб судьбы",
                "is71" => "Долина Драконов",
                "is72" => "Башня Будды",
                "is73" => "Башня Будды",
                "is74" => "Башня Будды",
                "is75" => "Башня Будды",
                "is76" => "Море иллюзий",
                "is77" => "Арена героев",
                "is78" => "Западные земли",
                "is79" => "Снежный замок",
                "is80" => "Заоблачный мир",
                "is81" => "Заоблачный мир",
                "is82" => "Заоблачный мир",
                "is83" => "Заоблачный мир",
                "is84" => "Виноградная долина",
                "is85" => "Музей",
                "is86" => "Дворц Рассвета",
                "is87" => "Озеро Миражей",
                "is88" => "Пустынные руины",
                "is89" => "Лесные руины",
                "is90" => "Дворц Рассвета",
                "is92" => "Западные земли (Режим сюжета)",
                "is93" => "",
                "arena01" => "Арена Города Мечей",
                "arena02" => "Арена Города Оборотней",
                "arena03" => "Арена Города Перьев",
                "arena04" => "Арена Города Драконов",
                "rand03" => "Мираж песчаных бурь",
                "rand04" => "Мираж блуждающих песков",
                "bg01" => "Поле битвы 1",
                "bg02" => "Поле битвы 2",
                "bg03" => "Поле битвы 3",
                "bg04" => "Поле битвы 4",
                "bg05" => "Поле битвы 5",
                "bg06" => "Поле битвы 6",
            );
        return $list;
    }

    public function education($id = null) {
        $list = Array(
            0 => 'Стойкий',
            1 => 'Любопытный',
            2 => 'Опытный',
            3 => 'Рассудительный',
            4 => 'Загадочный',
            5 => 'Жестокий',
            6 => 'Злой',
            7 => 'Отрешенный',
            8 => 'Благочестивый',
            20 => 'Безупречный',
            21 => 'Просвященный',
            22 => 'Бессмертный',
            30 => 'Демон',
            31 => 'Дух зла',
            32 => 'Сын ада',
        );
        if ( $id === null ) return $list;
        return $list[$id];
    }

    public function factionrole( $id = null ) {
        $a = Array("", "", "Мастер", "Маршал", "Майор", "Капитан", "Член");
        return $id ? $a[$id] : $a;
    }

    public function gender( $s = 0 ) {
        $g = Array("Мужской", "Женский");
        return $g[$s];
    }

    public function toRusNameRoleParam( $p ) {
        $parms = Array(
                'cls' => 'Класс персонажа',
                'create_time' => 'Дата создания',
                'factionid' => 'Клан ID',
                'factionrole' => 'Клан роль ID',
                'gender' => 'Пол персонажа',
                'id' => 'ID персонажа',
                'lastlogin_time' => 'Последняя авторизация',
                'name' => 'Никнейм персонажа',
                'race' => 'Расса персонажа',
                'userid' => 'ID аккаунта',
                '' => '',
                '' => '',
                '' => '',
                '' => '',
                '' => '',
                '' => '',
                '' => '',
                '' => '',
                '' => '',
                '' => '',
                '' => '',

            );
        return ;
    }

}